{
  "nav": {
    "main": "ГЛАВНАЯ",
    "hardSkills": "ХАРД_СКИЛЛЫ",
    "softSkills": "СОФТ_СКИЛЛЫ",
    "courses": "КУРСЫ",
    "projects": "ПРОЕКТЫ"
  },
  "titles": {
    "hardSkills": "Хард Скиллы",
    "softSkills": "Софт Скиллы",
    "courses": "Курсы",
    "projects": "Проекты"
  },
  "mainInfo": {
    "name": "Александр Василевский",
    "position": "Фронтенд разработчик(React)"
  },
  "softSkills": [
    {
      "title": "Внимательность и фокусировка",
      "text": "Больше года использую методику Pomodoro. Благодаря этой методике научился фокусироваться на поставленных задачах и делать вещи не отвлекаясь. Использую приложение для тайм-менеджмента, куда заношу разного рода задачи и стараюсь придерживаться плана на день."
    },
    {
      "title": "Умение работать в команде",
      "text": "Около 3 лет работа была связана с работой в коллективе. Множество разноплановых задач приходилось решать, как взаимодействуя с руководством, так и с коллективом. Качественная командная работа повышала не только качество работы, а так же создавала доверительные отношения."
    },
    {
      "title": "Ответственность",
      "text": "Всегда приходил на работу вовремя. Периодически оставался после работы, чтобы помочь, если того требовали обстоятельства. Мог выйти в выходной, если мне давали отгул в будний день. Периодически, если случаются важные встречи, то просчитываю время с запасом с помощью карт, чтобы не опаздывать. Больше года назад я дал себе обещание добавлять новые английские слова в приложении каждый день и я это делаю уже более 600 дней."
    },
    {
      "title": "Самостоятельность",
      "text": "Начинал изучать программирование по курсам, но понял, что там дают минимум информации, поэтому многое пришлось изучать самостоятельно используя интернет и курсы с разных площадок. На данный момент периодически прибегаю к вопросам к более опытным специалистам. Около трёх лет пассивно изучал английский, достигнув неплохих результатов в понимании английского. Благодаря английскому сейчас получаю удовольствие от чтения книг в оригинале."
    },
    {
      "title": "Коммуникабельность",
      "text": "Я открытый человек, который всегда готов поделиться своим опытом или высказать своё мнение. Стараюсь искать свой подход в общении с разными людьми. Умею конструктивно критиковать и воспринимать критику от других. "
    }
  ],
  "hardSkills": [
    {
      "id": 0,
      "title": "JavaScript",
      "text": [
        "Изучаю с 02.2022. За время знакомства изучил: переменные, объекты, массивы, функции, мутации, области видимости, операторы, выражения и инструкции, функциональные выражения, тернарный оператор, циклы, классы, прототипы, промисы, асинхронные функции(fetch, async/await), API и т.д. ",
        "Периодически изучаю новую информацию для улучшения понимания работы JS."
      ]
    },
    {
      "id": 1,
      "title": "React",
      "text": [
        "Начал изучение React с 05.2022. Свой путь начал с изучения классового React и сделал на нём MVP проект с курса. По завершению изучения классового React перешёл на функциональный. Изучил функциональные компоненты, HOC, Hooks, react-router-dom. "
      ]
    },
    {
      "id": 2,
      "title": "GIT",
      "text": [
        "Git использую с начала изучения программирования. Умею создавать свои репозитории, работать с чужими и выполнять основные операции. "
      ]
    },
    {
      "id": 3,
      "title": "Англ.яз.",
      "text": [
        "Имею хороший словарный запас(более 5000 слов), знаю английский на уровне B1, постоянно читаю художественную литературу и повышаю свой уровень английского языка. Учился в школе английского языка."
      ]
    },
    {
      "id": 4,
      "title": "TypeScript",
      "text": [
        "Умею использовать TypeScript в React, понимаю его важность для крупных проектов."
      ]
    },
    {
      "id": 5,
      "title": "Docker",
      "text": [
        "Прошёл курс по докеру и узнал: для чего нужен докер; что такое контейнер, образ; как создавать образы; открытые и закрытые порты, подключение томов, структуру docker.yml и docker-compose.yml.",
        "На курсе запускал небольшой контейнер состоящий из бекенда, базы данных, фронтенда и Adminer(инструмент администрирования базы данных)."
      ]
    },
    {
      "id": 6,
      "title": "HTML/SCSS",
      "text": [
        "Умею пользоваться семантическими тегами. Правильно вкладывать теги.",
        "Понимаю основные моменты SCSS. Постоянно использую его для создания проектов на React. Умею находить решения для поставленных задач по вёрстке."
      ]
    }
  ],
  "courses": [
    {
      "image": "./images/skill_factory.png",
      "cerfUrl": "https://skillfactory.ru/python-fullstack-web-developer",
      "title": "Fullstack-разработчик на Python",
      "completed": ">70%",
      "time": "18 месяцев",
      "subject": "JS, Python"
    },
    {
      "image": "./images/react_full_stashchuk.jpg",
      "cerfUrl": "https://www.udemy.com/certificate/UC-1258ef1f-207a-4ede-8861-9792a0565590/",
      "title": "React - Полный курс по React",
      "completed": "100%",
      "time": "21 час",
      "subject": "React"
    },
    {
      "image": "./images/js_full_stashchuk.jpg",
      "cerfUrl": "https://www.udemy.com/certificate/UC-e82d5550-e959-4901-b517-b93c242527e0/",
      "title": "JavaScript - Полный курс по JS",
      "completed": "100%",
      "time": "23 часа",
      "subject": "JavaScript"
    },
    {
      "image": "./images/docker_full_stashchuk.jpg",
      "cerfUrl": "https://www.udemy.com/certificate/UC-027b44a8-1adc-4621-bdf6-aaadebed1411/",
      "title": "Docker - Полный курс Docker",
      "completed": "100%",
      "time": "7 часов",
      "subject": "Docker"
    }
  ],
  "coursesDescription": {
    "duration": "Продолжительность",
    "technologies": "Технологии",
    "completed": "Завершено",
    "certificate": "Сертификат",
    "link": "Ссылка"
  },
  "projectLink": {
    "git": "GIT",
    "site": "САЙТ"
  }
}
