// import pngReact from "../assets/images/react.png";
// import pngJS from "../assets/images/javascript.png";
// import pngDocker from "../assets/images/docker.png";
// import pngGit from "../assets/images/git_1.png";
// import pngEnglish from "../images/";
// import pngEnglish from "../assets/images/english.png";

// export const hardSkills = [
//   {
//     id: 0,
//     title: "React",
//     // icon: pngReact,
//     text: [
//       `Начинал изучения со старой версии React построенной на классах и Redux, там я изучил: react-redux, JSX-компоненты, props, методы жизненного цикла, компоненты, react-router-dom, redux-form, npm, HOC, modules css, VDOM Позже перешёл на новый React.`,
//       `В большинстве своём понял, что там всё, как в старом React, за исключением изменений упрощающим жизнь. Вновом реакте изучил: хуки(setState, setEffect, ReactRouter), функциональные компоненты. Прошёл полный курс с получение сертификата.`,
//     ],
//   },

//   {
//     id: 1,
//     title: "JavaScript",
//     // icon: pngJS,
//     text: [
//       `Изучаю с января 2022. За время знакомства изучил: переменные, объекты, массивы, функции, мутации, области видимости, операторы, выражения и инструкции, функциональные выражения, тернарный оператор, циклы, классы, прототипы, промисы, асинхронные функции(fetch, async/await), API и т.д.
//       Так же для себя прошёл полноценный курс, для укрепления знаний.
//       Раньше решал задачи на CodeWars.`,
//     ],
//   },

//   {
//     id: 2,
//     title: "Docker",
//     // icon: pngDocker,
//     text: [
//       "Прошёл курс по докеру и узнал: для чего нужне докер; что такое контейнер, образ; как создавать образы; открытые и закрытые порты, подключение томов, структуру docker.yml и docker-compose.yml.",
//       "На курсе запускал небольшой контейнер состоящий из бекенда, базы данных, фронтенда и Adminer(инструмент администрирования базы данных).",
//     ],
//   },

//   {
//     id: 3,
//     title: "GIT",
//     // icon: pngGit,
//     text: [
//       "С гитом знаком с начала обучения(апрель 2021). Периодически что-то мерджил, удалял версии репозиториев, откатывал репозитории и т.д.",
//     ],
//   },

//   {
//     id: 4,
//     title: "English",
//     // icon: pngEnglish,
//     text: [
//       "Что касается английского. Умею читать на нём, имею достаточно обширный словарный запас. Уделяю ему каждый день минимум по часу.",
//     ],
//   },
// ];

export const hardSkills = [
  {
    id: 0,
    title: "React",
    text: [
      `I need more information about it. I need more information about it. I need more information about it. I need more information about it.`,
      `В большинстве своём понял, что там всё, как в старом React, за исключением изменений упрощающим жизнь. Вновом реакте изучил: хуки(setState, setEffect, ReactRouter), функциональные компоненты. Прошёл полный курс с получение сертификата.`,
    ],
  },

  {
    id: 1,
    title: "JavaScript",
    text: [
      `Изучаю с января 2022. За время знакомства изучил: переменные, объекты, массивы, функции, мутации, области видимости, операторы, выражения и инструкции, функциональные выражения, тернарный оператор, циклы, классы, прототипы, промисы, асинхронные функции(fetch, async/await), API и т.д. 
      Так же для себя прошёл полноценный курс, для укрепления знаний.
      Раньше решал задачи на CodeWars.`,
    ],
  },

  {
    id: 2,
    title: "Docker",
    text: [
      "Прошёл курс по докеру и узнал: для чего нужне докер; что такое контейнер, образ; как создавать образы; открытые и закрытые порты, подключение томов, структуру docker.yml и docker-compose.yml.",
      "На курсе запускал небольшой контейнер состоящий из бекенда, базы данных, фронтенда и Adminer(инструмент администрирования базы данных).",
    ],
  },

  {
    id: 3,
    title: "GIT",
    text: [
      "С гитом знаком с начала обучения(апрель 2021). Периодически что-то мерджил, удалял версии репозиториев, откатывал репозитории и т.д.",
    ],
  },

  {
    id: 4,
    title: "English",
    text: [
      "Что касается английского. Умею читать на нём, имею достаточно обширный словарный запас. Уделяю ему каждый день минимум по часу.",
    ],
  },
];

export const shortHardSkills = [
  "Javascript",
  "React",
  "Redux",
  "CSS/HTML",
  "Docker",
  "GIT",
  "BootStrap",
  "Figma",
  "English",
  "SCSS",
];
