{
  "nav": {
    "main": "MAIN",
    "hardSkills": "HARD_SKILLS",
    "softSkills": "SOFT_SKILLS",
    "courses": "COURSES",
    "projects": "PROJECTS"
  },
  "titles": {
    "hardSkills": "Hard Skills",
    "softSkills": "Soft Skills",
    "courses": "Courses",
    "projects": "Projects"
  },
  "mainInfo": {
    "name": "Alexander Vasilevsky",
    "position": "Front-end developer(React)"
  },
  "softSkills": [
    {
      "title": "Mindfulness and focus",
      "text": "I have been using the Pomodoro technique for about a year. Thanks to this technique, I learned to focus on the tasks set and do things without being distracted. I use an application for time management, where I enter various kinds of tasks and try to stick to the plan for the day."
    },
    {
      "title": "Ability to work in a team",
      "text": "For about 3 years, the work was connected with working in a team. I had to solve a lot of diverse tasks, both interacting with the management and with the team. High-quality teamwork increased not only the quality of work, but also created trusting relationships."
    },
    {
      "title": "Responsibility",
      "text": "Always came to work on time. Periodically stayed after work to help if circumstances required it. I could go out on a day off if I was given a day off on a weekday. Periodically, if important meetings happen, I calculate the time with a margin using maps so as not to be late. More than a year ago, I made a promise to myself to add new English words to the app every day and I have been doing this for more than 600 days."
    },
    {
      "title": "Independence",
      "text": "I started studying programming courses, but realized that they give a minimum of information, so I had to study a lot on my own using the Internet and courses from different sites. At the moment, I periodically resort to questions from more experienced specialists. For about three years I passively studied English, having achieved good results in understanding English. Thanks to English, I now enjoy reading books in the original."
    },
    {
      "title": "Communication",
      "text": "I am an open person who is always ready to share my experience or express my opinion. I try to look for my own approach in communicating with different people. I'm able to criticize constructively and accept criticism from others."
    }
  ],
  "hardSkills": [
    {
      "id": 0,
      "title": "JavaScript",
      "text": [
        "I have been studying since 02.2022. During the acquaintance I studied: variables, objects, arrays, functions, mutations, scopes, operators, expressions and instructions, functional expressions, ternary operator, loops, classes, prototypes, promises, asynchronous functions (fetch, async/await), API, etc. ",
        "Periodically I study new information to improve my understanding of the work of JS."
      ]
    },
    {
      "id": 1,
      "title": "React",
      "text": [
        "I started studying React from 05.2022. I started my journey by studying the class React and using it I made an MVP project from the course. After completion of the class React study, I switched to functional. I studied the functional components, HOC, Hooks, react-router-dom."
      ]
    },
    {
      "id": 2,
      "title": "GIT",
      "text": [
        "I have been using Git since the beginning of studying programming. I can create my own repositories, work with other people's repositories and perform basic operations."
      ]
    },
    {
      "id": 3,
      "title": "English",
      "text": [
        "I have a good vocabulary (more than 5000 words), I know English at the B1 level, I constantly read fiction and improve my level of English. I studied at an English language school."
      ]
    },
    {
      "id": 4,
      "title": "TypeScript",
      "text": [
        "I know how to use TypeScript in React, I understand it’s importance for large projects."
      ]
    },
    {
      "id": 5,
      "title": "Docker",
      "text": [
        "I took a docker course and learned: what is a docker for; what is a container, an image; how to create images; open and closed ports, volume connection, docker.yml structure and docker-compose.yml.",
        "During the course, I launched a small container consisting of a backend, database, frontend and Adminer (database administration tool)."
      ]
    },
    {
      "id": 6,
      "title": "HTML/SCSS",
      "text": [
        "I know how to use semantic tags. Embed tags correctly. I give him at least an hour every day.",
        "I understand the main points of SCSS. I constantly use it to create projects on React. I am able to find solutions for tasks related to layout."
      ]
    }
  ],
  "courses": [
    {
      "image": "./images/skill_factory.png",
      "cerfUrl": "https://skillfactory.ru/python-fullstack-web-developer",
      "title": "Fullstack-developer on Python",
      "completed": ">70%",
      "time": "18 months",
      "subject": "JS, Python"
    },
    {
      "image": "./images/react_full_stashchuk.jpg",
      "cerfUrl": "https://www.udemy.com/certificate/UC-1258ef1f-207a-4ede-8861-9792a0565590/",
      "title": "React - Full course on React",
      "completed": "100%",
      "time": "21 hours",
      "subject": "React"
    },
    {
      "image": "./images/js_full_stashchuk.jpg",
      "cerfUrl": "https://www.udemy.com/certificate/UC-e82d5550-e959-4901-b517-b93c242527e0/",
      "title": "JavaScript - Full course on JS",
      "completed": "100%",
      "time": "23 hours",
      "subject": "JavaScript"
    },
    {
      "image": "./images/docker_full_stashchuk.jpg",
      "cerfUrl": "https://www.udemy.com/certificate/UC-027b44a8-1adc-4621-bdf6-aaadebed1411/",
      "title": "Docker - Full course on Docker",
      "completed": "100%",
      "time": "7 hours",
      "subject": "Docker"
    }
  ],
  "coursesDescription": {
    "duration": "Duration",
    "technologies": "Techologies",
    "completed": "Completed",
    "certificate": "Certificate",
    "link": "Link"
  },
  "projectLink": {
    "git": "GIT",
    "site": "SITE"
  }
}
