{
  "nav": {
    "main": "MAIN",
    "hardSkills": "HARD_SKILLS",
    "softSkills": "SOFT_SKILLS",
    "courses": "COURSES",
    "projects": "PROJECTS"
  },
  "titles": {
    "hardSkills": "Hard Skills",
    "softSkills": "Soft Skills",
    "courses": "Courses",
    "projects": "Projects"
  },
  "mainInfo": {
    "name": "Alexander Vasilevsky",
    "position": "Front-end developer(React)"
  },
  "softSkills": [
    {
      "skillTitle": "Mindfulness and focus",
      "textTitle": "\n    About six months ago I mastered the Pomodoro technique, which helps me focus on things.\nShe changed my life quite a lot.\nDuring this time, I trained myself not to be distracted by anything and enter the flow state while the tomato is going (50 min of work / 10 min of rest).\nI also keep records in the toDo(TickTick) application, which helps me not to forget anything and record the time spent on tasks.\n    "
    },
    {
      "skillTitle": "Ability to work in a team",
      "textTitle": "\n    At the last job, interacting with the team, it was necessary to be able to adapt to each other and issue different tasks.\nBecause in literally one task, the next one could immediately follow.\nTherefore, I know firsthand what it is to work in a team :)\n    "
    },
    {
      "skillTitle": "Responsibility",
      "textTitle": "\n    Both in life and in work, I approach everything responsibly. If I take on something, I bring it to the end. No one from my team could say that I was irresponsible. Rather, on the contrary, they were praised for this quality.\n    "
    },
    {
      "skillTitle": "Independence",
      "textTitle": "\n    I study programming on my own. Well, how to do it yourself - according to courses, documentation and YouTube :)\nI also study English myself, using various applications, educational books, and fiction.\nI live an independent life: I provide for myself, clean, cook, etc.\n    "
    },
    {
      "skillTitle": "Communication",
      "textTitle": "\n    In my last job, I interacted productively with both management and staff.\nThe organization consisted of 8 people. He offered his ideas for solving certain tasks, tried to help get out of various situations concerning the organization.\nPeriodically interacted with customers when required.\n    "
    }
  ],
  "hardSkills": [
    {
      "id": 0,
      "title": "React",
      "text": [
        "For the most part, I realized that everything there is like in the old React, except for the changes that simplify life. In the new reaction I studied: cookies(setState, setEffect, ReactRouter), functional components. Completed a full course with a certificate."
      ]
    },
    {
      "id": 1,
      "title": "JavaScript",
      "text": [
        "I have been studying since January 2022. During the acquaintance I studied: variables, objects, arrays, functions, mutations, scopes, operators, expressions and instructions, functional expressions, ternary operator, loops, classes, prototypes, promises, asynchronous functions (fetch, async/await), API, etc. \n     So I took a full-fledged course for myself, to strengthen my knowledge. \n      Раньше решал задачи на CodeWars."
      ]
    },
    {
      "id": 2,
      "title": "Docker",
      "text": [
        "I took a docker course and learned: what a docker is for; what is a container, an image; how to create images; open and closed ports, volume connection, docker.yml structure and docker-compose.yml.",
        "During the course, I launched a small container consisting of a backend, database, frontend and Adminer (database administration tool)."
      ]
    },
    {
      "id": 3,
      "title": "GIT",
      "text": [
        "I have been familiar with git since the beginning of training (April 2021). From time to time, I was doing something, deleting repository versions, rolling back repositories, etc."
      ]
    },
    {
      "id": 4,
      "title": "English",
      "text": [
        "As for English. I can read it, I have a fairly extensive vocabulary. I give him at least an hour every day."
      ]
    }
  ],
  "courses": [
    {
      "image": "./images/skill_factory.png",
      "cerfUrl": "https://skillfactory.ru/python-fullstack-web-developer",
      "title": "Fullstack-developer on Python",
      "completed": ">70%",
      "time": "18 months",
      "subject": "JS, Python"
    },
    {
      "image": "./images/react_full_stashchuk.jpg",
      "cerfUrl": "https://www.udemy.com/certificate/UC-1258ef1f-207a-4ede-8861-9792a0565590/",
      "title": "React - Full course on React",
      "completed": "100%",
      "time": "21 hours",
      "subject": "React"
    },
    {
      "image": "./images/js_full_stashchuk.jpg",
      "cerfUrl": "https://www.udemy.com/certificate/UC-e82d5550-e959-4901-b517-b93c242527e0/",
      "title": "JavaScript - Full course on JS",
      "completed": "100%",
      "time": "23 hours",
      "subject": "JavaScript"
    },
    {
      "image": "./images/docker_full_stashchuk.jpg",
      "cerfUrl": "https://www.udemy.com/certificate/UC-027b44a8-1adc-4621-bdf6-aaadebed1411/",
      "title": "Docker - Full course on Docker",
      "completed": "100%",
      "time": "7 hours",
      "subject": "Docker"
    }
  ],
  "coursesDescription": {
    "duration": "Duration",
    "technologies": "Techologies",
    "completed": "Completed",
    "certificate": "Certificate",
    "link": "Link"
  },
  "projectLink": {
    "git": "GIT",
    "site": "SITE"
  }
}
